package com.ohgiraffers.looping;

public class Question {

    /* 1부터 10까지의 숫자를 출력하는 프로그램 */

    /* 10부터 1까지의 숫자를 역순으로 출력하는 프로그램 */

    /* 구구단 7단을 출력하는 프로그램 */

    /* 1부터 100까지의 숫자 중 짝수만 출력하는 프로그램 */

    /* 사용자로부터 입력받은 숫자의 팩토리얼을 계산하는 프로그램
    *   팩토리얼은 6! = 1 * 2 * 3 * 4 * 5 * 6
    * */

    /* 0시 0분에서 23시 59분 까지 출력하는 프로그램을 작성해보자 */

    /* 별 만들기 게임
    *   *
    *   **
    *   ***
    *   ****
    *   *****
    *   이런 식으로 행이 늘어날 때 별도 들어나는 식을 만들어보자
    *
    *  */

    /* 별 만들기 게임
     *      *
     *     ***
     *    *****
     *   *******
     *
     *   이런 식으로 행이 늘어날 때 별도 들어나는 식을 만들어보자
     *
     *  */

    /* 별 만들기 게임
     *       *
     *     ***
     *    ****
     *   *****
     *
     *   이런 식으로 행이 늘어날 때 별도 들어나는 식을 만들어보자
     *
     *  */

}
